ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5335.h
#define DMA4TSEL_0          (0x0000)  /* DMA channel 4 transfer select 0:  DMA_REQ (sw) */
#define DMA4TSEL_1          (0x0001)  /* DMA channel 4 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA4TSEL_2          (0x0002)  /* DMA channel 4 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA4TSEL_3          (0x0003)  /* DMA channel 4 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA4TSEL_4          (0x0004)  /* DMA channel 4 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA4TSEL_5          (0x0005)  /* DMA channel 4 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA4TSEL_6          (0x0006)  /* DMA channel 4 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA4TSEL_7          (0x0007)  /* DMA channel 4 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA4TSEL_8          (0x0008)  /* DMA channel 4 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA4TSEL_9          (0x0009)  /* DMA channel 4 transfer select 9:  Reserved */
#define DMA4TSEL_10         (0x000A) /* DMA channel 4 transfer select 10: Reserved */
#define DMA4TSEL_11         (0x000B) /* DMA channel 4 transfer select 11: Reserved */
#define DMA4TSEL_12         (0x000C) /* DMA channel 4 transfer select 12: Reserved */
#define DMA4TSEL_13         (0x000D) /* DMA channel 4 transfer select 13: Reserved */
#define DMA4TSEL_14         (0x000E) /* DMA channel 4 transfer select 14: Reserved */
#define DMA4TSEL_15         (0x000F) /* DMA channel 4 transfer select 15: Reserved */
#define DMA4TSEL_16         (0x0010) /* DMA channel 4 transfer select 16: USCIA0 receive */
#define DMA4TSEL_17         (0x0011) /* DMA channel 4 transfer select 17: USCIA0 transmit */
#define DMA4TSEL_18         (0x0012) /* DMA channel 4 transfer select 18: USCIB0 receive */
#define DMA4TSEL_19         (0x0013) /* DMA channel 4 transfer select 19: USCIB0 transmit */
#define DMA4TSEL_20         (0x0014) /* DMA channel 4 transfer select 20: USCIA1 receive */
#define DMA4TSEL_21         (0x0015) /* DMA channel 4 transfer select 21: USCIA1 transmit */
#define DMA4TSEL_22         (0x0016) /* DMA channel 4 transfer select 22: USCIB1 receive */
#define DMA4TSEL_23         (0x0017) /* DMA channel 4 transfer select 23: USCIB1 transmit */
#define DMA4TSEL_24         (0x0018) /* DMA channel 4 transfer select 24: ADC12IFGx */
#define DMA4TSEL_25         (0x0019) /* DMA channel 4 transfer select 25: DAC12_0IFG */
#define DMA4TSEL_26         (0x001A) /* DMA channel 4 transfer select 26: DAC12_1IFG */
#define DMA4TSEL__RES27     (0x001B) /* DMA channel 4 transfer select 27: Reserved */
#define DMA4TSEL__RES28     (0x001C) /* DMA channel 4 transfer select 28: Reserved */
#define DMA4TSEL_29         (0x001D) /* DMA channel 4 transfer select 29: Multiplier ready */
#define DMA4TSEL_30         (0x001E) /* DMA channel 4 transfer select 30: previous DMA channel DMA3IFG */
#define DMA4TSEL_31         (0x001F) /* DMA channel 4 transfer select 31: ext. Trigger (DMAE0) */

#define DMA5TSEL_0          (0x0000)  /* DMA channel 5 transfer select 0:  DMA_REQ (sw) */
#define DMA5TSEL_1          (0x0100)  /* DMA channel 5 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA5TSEL_2          (0x0200)  /* DMA channel 5 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA5TSEL_3          (0x0300)  /* DMA channel 5 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA5TSEL_4          (0x0400)  /* DMA channel 5 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA5TSEL_5          (0x0500)  /* DMA channel 5 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA5TSEL_6          (0x0600)  /* DMA channel 5 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA5TSEL_7          (0x0700)  /* DMA channel 5 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA5TSEL_8          (0x0800)  /* DMA channel 5 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA5TSEL_9          (0x0900)  /* DMA channel 5 transfer select 9:  Reserved */
#define DMA5TSEL_10         (0x0A00) /* DMA channel 5 transfer select 10: Reserved */
#define DMA5TSEL_11         (0x0B00) /* DMA channel 5 transfer select 11: Reserved */
#define DMA5TSEL_12         (0x0C00) /* DMA channel 5 transfer select 12: Reserved */
#define DMA5TSEL_13         (0x0D00) /* DMA channel 5 transfer select 13: Reserved */
#define DMA5TSEL_14         (0x0E00) /* DMA channel 5 transfer select 14: Reserved */
#define DMA5TSEL_15         (0x0F00) /* DMA channel 5 transfer select 15: Reserved */
#define DMA5TSEL_16         (0x1000) /* DMA channel 5 transfer select 16: USCIA0 receive */
#define DMA5TSEL_17         (0x1100) /* DMA channel 5 transfer select 17: USCIA0 transmit */
#define DMA5TSEL_18         (0x1200) /* DMA channel 5 transfer select 18: USCIB0 receive */
#define DMA5TSEL_19         (0x1300) /* DMA channel 5 transfer select 19: USCIB0 transmit */
#define DMA5TSEL_20         (0x1400) /* DMA channel 5 transfer select 20: USCIA1 receive */
#define DMA5TSEL_21         (0x1500) /* DMA channel 5 transfer select 21: USCIA1 transmit */
#define DMA5TSEL_22         (0x1600) /* DMA channel 5 transfer select 22: USCIB1 receive */
#define DMA5TSEL_23         (0x1700) /* DMA channel 5 transfer select 23: USCIB1 transmit */
#define DMA5TSEL_24         (0x1800) /* DMA channel 5 transfer select 24: ADC12IFGx */
#define DMA5TSEL_25         (0x1900) /* DMA channel 5 transfer select 25: DAC12_0IFG */
#define DMA5TSEL_26         (0x1A00) /* DMA channel 5 transfer select 26: DAC12_1IFG */
#define DMA5TSEL__RES27     (0x1B00) /* DMA channel 5 transfer select 27: Reserved */
#define DMA5TSEL__RES28     (0x1C00) /* DMA channel 5 transfer select 28: Reserved */
#define DMA5TSEL_29         (0x1D00) /* DMA channel 5 transfer select 29: Multiplier ready */
#define DMA5TSEL_30         (0x1E00) /* DMA channel 5 transfer select 30: previous DMA channel DMA4IFG */
#define DMA5TSEL_31         (0x1F00) /* DMA channel 5 transfer select 31: ext. Trigger (DMAE0) */

#define DMA0TSEL__DMA_REQ    (0x0000)  /* DMA channel 0 transfer select 0:  DMA_REQ (sw) */
#define DMA0TSEL__TA0CCR0    (0x0001)  /* DMA channel 0 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA0TSEL__TA0CCR2    (0x0002)  /* DMA channel 0 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA0TSEL__TA1CCR0    (0x0003)  /* DMA channel 0 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA0TSEL__TA1CCR2    (0x0004)  /* DMA channel 0 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA0TSEL__TA2CCR0    (0x0005)  /* DMA channel 0 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA0TSEL__TA2CCR2    (0x0006)  /* DMA channel 0 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA0TSEL__TB0CCR0    (0x0007)  /* DMA channel 0 transfer select 7:  TimerB0  (TB0CCR0.IFG) */
#define DMA0TSEL__TB0CCR2    (0x0008)  /* DMA channel 0 transfer select 8:  TimerB0  (TB0CCR2.IFG) */
#define DMA0TSEL__RES9       (0x0009)  /* DMA channel 0 transfer select 9:  Reserved */
#define DMA0TSEL__RES10      (0x000A) /* DMA channel 0 transfer select 10: Reserved */
#define DMA0TSEL__RES11      (0x000B) /* DMA channel 0 transfer select 11: Reserved */
#define DMA0TSEL__RES12      (0x000C) /* DMA channel 0 transfer select 12: Reserved */
#define DMA0TSEL__RES13      (0x000D) /* DMA channel 0 transfer select 13: Reserved */
#define DMA0TSEL__RES14      (0x000E) /* DMA channel 0 transfer select 14: Reserved */
#define DMA0TSEL__RES15      (0x000F) /* DMA channel 0 transfer select 15: Reserved */
#define DMA0TSEL__USCIA0RX   (0x0010) /* DMA channel 0 transfer select 16: USCIA0 receive */
#define DMA0TSEL__USCIA0TX   (0x0011) /* DMA channel 0 transfer select 17: USCIA0 transmit */
#define DMA0TSEL__USCIB0RX   (0x0012) /* DMA channel 0 transfer select 18: USCIB0 receive */
#define DMA0TSEL__USCIB0TX   (0x0013) /* DMA channel 0 transfer select 19: USCIB0 transmit */
#define DMA0TSEL__USCIA1RX   (0x0014) /* DMA channel 0 transfer select 20: USCIA1 receive */
#define DMA0TSEL__USCIA1TX   (0x0015) /* DMA channel 0 transfer select 21: USCIA1 transmit */
#define DMA0TSEL__USCIB1RX   (0x0016) /* DMA channel 0 transfer select 22: USCIB1 receive */
#define DMA0TSEL__USCIB1TX   (0x0017) /* DMA channel 0 transfer select 23: USCIB1 transmit */
#define DMA0TSEL__ADC12IFG   (0x0018) /* DMA channel 0 transfer select 24: ADC12IFGx */
#define DMA0TSEL__RES25      (0x0019) /* DMA channel 0 transfer select 25: Reserved */
#define DMA0TSEL__RES26      (0x001A) /* DMA channel 0 transfer select 26: Reserved */
#define DMA0TSEL__RES27      (0x001B) /* DMA channel 0 transfer select 27: Reserved */
#define DMA0TSEL__RES28      (0x001C) /* DMA channel 0 transfer select 28: Reserved */
#define DMA0TSEL__MPY        (0x001D) /* DMA channel 0 transfer select 29: Multiplier ready */
#define DMA0TSEL__DMA5IFG    (0x001E) /* DMA channel 0 transfer select 30: previous DMA channel DMA5IFG */
#define DMA0TSEL__DMAE0      (0x001F) /* DMA channel 0 transfer select 31: ext. Trigger (DMAE0) */

#define DMA1TSEL__DMA_REQ    (0x0000)  /* DMA channel 1 transfer select 0:  DMA_REQ (sw) */
#define DMA1TSEL__TA0CCR0    (0x0100)  /* DMA channel 1 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA1TSEL__TA0CCR2    (0x0200)  /* DMA channel 1 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA1TSEL__TA1CCR0    (0x0300)  /* DMA channel 1 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA1TSEL__TA1CCR2    (0x0400)  /* DMA channel 1 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA1TSEL__TA2CCR0    (0x0500)  /* DMA channel 1 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA1TSEL__TA2CCR2    (0x0600)  /* DMA channel 1 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA1TSEL__TB0CCR0    (0x0700)  /* DMA channel 1 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA1TSEL__TB0CCR2    (0x0800)  /* DMA channel 1 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA1TSEL__RES9       (0x0900)  /* DMA channel 1 transfer select 9:  Reserved */
#define DMA1TSEL__RES10      (0x0A00) /* DMA channel 1 transfer select 10: Reserved */
#define DMA1TSEL__RES11      (0x0B00) /* DMA channel 1 transfer select 11: Reserved */
#define DMA1TSEL__RES12      (0x0C00) /* DMA channel 1 transfer select 12: Reserved */
#define DMA1TSEL__RES13      (0x0D00) /* DMA channel 1 transfer select 13: Reserved */
#define DMA1TSEL__RES14      (0x0E00) /* DMA channel 1 transfer select 14: Reserved */
#define DMA1TSEL__RES15      (0x0F00) /* DMA channel 1 transfer select 15: Reserved */
#define DMA1TSEL__USCIA0RX   (0x1000) /* DMA channel 1 transfer select 16: USCIA0 receive */
#define DMA1TSEL__USCIA0TX   (0x1100) /* DMA channel 1 transfer select 17: USCIA0 transmit */
#define DMA1TSEL__USCIB0RX   (0x1200) /* DMA channel 1 transfer select 18: USCIB0 receive */
#define DMA1TSEL__USCIB0TX   (0x1300) /* DMA channel 1 transfer select 19: USCIB0 transmit */
#define DMA1TSEL__USCIA1RX   (0x1400) /* DMA channel 1 transfer select 20: USCIA1 receive */
#define DMA1TSEL__USCIA1TX   (0x1500) /* DMA channel 1 transfer select 21: USCIA1 transmit */
#define DMA1TSEL__USCIB1RX   (0x1600) /* DMA channel 1 transfer select 22: USCIB1 receive */
#define DMA1TSEL__USCIB1TX   (0x1700) /* DMA channel 1 transfer select 23: USCIB1 transmit */
#define DMA1TSEL__ADC12IFG   (0x1800) /* DMA channel 1 transfer select 24: ADC12IFGx */
#define DMA1TSEL__RES25      (0x1900) /* DMA channel 1 transfer select 25: Reserved */
#define DMA1TSEL__RES26      (0x1A00) /* DMA channel 1 transfer select 26: Reserved */
#define DMA1TSEL__RES27      (0x1B00) /* DMA channel 1 transfer select 27: Reserved */
#define DMA1TSEL__RES28      (0x1C00) /* DMA channel 1 transfer select 28: Reserved */
#define DMA1TSEL__MPY        (0x1D00) /* DMA channel 1 transfer select 29: Multiplier ready */
#define DMA1TSEL__DMA0IFG    (0x1E00) /* DMA channel 1 transfer select 30: previous DMA channel DMA0IFG */
#define DMA1TSEL__DMAE0      (0x1F00) /* DMA channel 1 transfer select 31: ext. Trigger (DMAE0) */

#define DMA2TSEL__DMA_REQ    (0x0000)  /* DMA channel 2 transfer select 0:  DMA_REQ (sw) */
#define DMA2TSEL__TA0CCR0    (0x0001)  /* DMA channel 2 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA2TSEL__TA0CCR2    (0x0002)  /* DMA channel 2 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA2TSEL__TA1CCR0    (0x0003)  /* DMA channel 2 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA2TSEL__TA1CCR2    (0x0004)  /* DMA channel 2 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA2TSEL__TA2CCR0    (0x0005)  /* DMA channel 2 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA2TSEL__TA2CCR2    (0x0006)  /* DMA channel 2 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA2TSEL__TB0CCR0    (0x0007)  /* DMA channel 2 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA2TSEL__TB0CCR2    (0x0008)  /* DMA channel 2 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA2TSEL__RES9       (0x0009)  /* DMA channel 2 transfer select 9:  Reserved */
#define DMA2TSEL__RES10      (0x000A) /* DMA channel 2 transfer select 10: Reserved */
#define DMA2TSEL__RES11      (0x000B) /* DMA channel 2 transfer select 11: Reserved */
#define DMA2TSEL__RES12      (0x000C) /* DMA channel 2 transfer select 12: Reserved */
#define DMA2TSEL__RES13      (0x000D) /* DMA channel 2 transfer select 13: Reserved */
#define DMA2TSEL__RES14      (0x000E) /* DMA channel 2 transfer select 14: Reserved */
#define DMA2TSEL__RES15      (0x000F) /* DMA channel 2 transfer select 15: Reserved */
#define DMA2TSEL__USCIA0RX   (0x0010) /* DMA channel 2 transfer select 16: USCIA0 receive */
#define DMA2TSEL__USCIA0TX   (0x0011) /* DMA channel 2 transfer select 17: USCIA0 transmit */
#define DMA2TSEL__USCIB0RX   (0x0012) /* DMA channel 2 transfer select 18: USCIB0 receive */
#define DMA2TSEL__USCIB0TX   (0x0013) /* DMA channel 2 transfer select 19: USCIB0 transmit */
#define DMA2TSEL__USCIA1RX   (0x0014) /* DMA channel 2 transfer select 20: USCIA1 receive */
#define DMA2TSEL__USCIA1TX   (0x0015) /* DMA channel 2 transfer select 21: USCIA1 transmit */
#define DMA2TSEL__USCIB1RX   (0x0016) /* DMA channel 2 transfer select 22: USCIB1 receive */
#define DMA2TSEL__USCIB1TX   (0x0017) /* DMA channel 2 transfer select 23: USCIB1 transmit */
#define DMA2TSEL__ADC12IFG   (0x0018) /* DMA channel 2 transfer select 24: ADC12IFGx */
#define DMA2TSEL__RES25      (0x0019) /* DMA channel 2 transfer select 25: Reserved */
#define DMA2TSEL__RES26      (0x001A) /* DMA channel 2 transfer select 26: Reserved */
#define DMA2TSEL__RES27      (0x001B) /* DMA channel 2 transfer select 27: Reserved */
#define DMA2TSEL__RES28      (0x001C) /* DMA channel 2 transfer select 28: Reserved */
#define DMA2TSEL__MPY        (0x001D) /* DMA channel 2 transfer select 29: Multiplier ready */
#define DMA2TSEL__DMA1IFG    (0x001E) /* DMA channel 2 transfer select 30: previous DMA channel DMA1IFG */
#define DMA2TSEL__DMAE0      (0x001F) /* DMA channel 2 transfer select 31: ext. Trigger (DMAE0) */

#define DMA3TSEL__DMA_REQ    (0x0000)  /* DMA channel 3 transfer select 0:  DMA_REQ (sw) */
#define DMA3TSEL__TA0CCR0    (0x0100)  /* DMA channel 3 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA3TSEL__TA0CCR2    (0x0200)  /* DMA channel 3 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA3TSEL__TA1CCR0    (0x0300)  /* DMA channel 3 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA3TSEL__TA1CCR2    (0x0400)  /* DMA channel 3 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA3TSEL__TA2CCR0    (0x0500)  /* DMA channel 3 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA3TSEL__TA2CCR2    (0x0600)  /* DMA channel 3 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA3TSEL__TB0CCR0    (0x0700)  /* DMA channel 3 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA3TSEL__TB0CCR2    (0x0800)  /* DMA channel 3 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA3TSEL__RES9       (0x0900)  /* DMA channel 3 transfer select 9:  Reserved */
#define DMA3TSEL__RES10      (0x0A00) /* DMA channel 3 transfer select 10: Reserved */
#define DMA3TSEL__RES11      (0x0B00) /* DMA channel 3 transfer select 11: Reserved */
#define DMA3TSEL__RES12      (0x0C00) /* DMA channel 3 transfer select 12: Reserved */
#define DMA3TSEL__RES13      (0x0D00) /* DMA channel 3 transfer select 13: Reserved */
#define DMA3TSEL__RES14      (0x0E00) /* DMA channel 3 transfer select 14: Reserved */
#define DMA3TSEL__RES15      (0x0F00) /* DMA channel 3 transfer select 15: Reserved */
#define DMA3TSEL__USCIA0RX   (0x1000) /* DMA channel 3 transfer select 16: USCIA0 receive */
#define DMA3TSEL__USCIA0TX   (0x1100) /* DMA channel 3 transfer select 17: USCIA0 transmit */
#define DMA3TSEL__USCIB0RX   (0x1200) /* DMA channel 3 transfer select 18: USCIB0 receive */
#define DMA3TSEL__USCIB0TX   (0x1300) /* DMA channel 3 transfer select 19: USCIB0 transmit */
#define DMA3TSEL__USCIA1RX   (0x1400) /* DMA channel 3 transfer select 20: USCIA1 receive */
#define DMA3TSEL__USCIA1TX   (0x1500) /* DMA channel 3 transfer select 21: USCIA1 transmit */
#define DMA3TSEL__USCIB1RX   (0x1600) /* DMA channel 3 transfer select 22: USCIB1 receive */
#define DMA3TSEL__USCIB1TX   (0x1700) /* DMA channel 3 transfer select 23: USCIB1 transmit */
#define DMA3TSEL__ADC12IFG   (0x1800) /* DMA channel 3 transfer select 24: ADC12IFGx */
#define DMA3TSEL__RES25      (0x1900) /* DMA channel 3 transfer select 25: Reserved */
#define DMA3TSEL__RES26      (0x1A00) /* DMA channel 3 transfer select 26: Reserved */
#define DMA3TSEL__RES27      (0x1B00) /* DMA channel 3 transfer select 27: Reserved */
#define DMA3TSEL__RES28      (0x1C00) /* DMA channel 3 transfer select 28: Reserved */
#define DMA3TSEL__MPY        (0x1D00) /* DMA channel 3 transfer select 29: Multiplier ready */
#define DMA3TSEL__DMA2IFG    (0x1E00) /* DMA channel 3 transfer select 30: previous DMA channel DMA2IFG */
#define DMA3TSEL__DMAE0      (0x1F00) /* DMA channel 3 transfer select 31: ext. Trigger (DMAE0) */

#define DMA4TSEL__DMA_REQ    (0x0000)  /* DMA channel 4 transfer select 0:  DMA_REQ (sw) */
#define DMA4TSEL__TA0CCR0    (0x0001)  /* DMA channel 4 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA4TSEL__TA0CCR2    (0x0002)  /* DMA channel 4 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA4TSEL__TA1CCR0    (0x0003)  /* DMA channel 4 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA4TSEL__TA1CCR2    (0x0004)  /* DMA channel 4 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA4TSEL__TA2CCR0    (0x0005)  /* DMA channel 4 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA4TSEL__TA2CCR2    (0x0006)  /* DMA channel 4 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA4TSEL__TB0CCR0    (0x0007)  /* DMA channel 4 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA4TSEL__TB0CCR2    (0x0008)  /* DMA channel 4 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA4TSEL__RES9       (0x0009)  /* DMA channel 4 transfer select 9:  Reserved */
#define DMA4TSEL__RES10      (0x000A) /* DMA channel 4 transfer select 10: Reserved */
#define DMA4TSEL__RES11      (0x000B) /* DMA channel 4 transfer select 11: Reserved */
#define DMA4TSEL__RES12      (0x000C) /* DMA channel 4 transfer select 12: Reserved */
#define DMA4TSEL__RES13      (0x000D) /* DMA channel 4 transfer select 13: Reserved */
#define DMA4TSEL__RES14      (0x000E) /* DMA channel 4 transfer select 14: Reserved */
#define DMA4TSEL__RES15      (0x000F) /* DMA channel 4 transfer select 15: Reserved */
#define DMA4TSEL__USCIA0RX   (0x0010) /* DMA channel 4 transfer select 16: USCIA0 receive */
#define DMA4TSEL__USCIA0TX   (0x0011) /* DMA channel 4 transfer select 17: USCIA0 transmit */
#define DMA4TSEL__USCIB0RX   (0x0012) /* DMA channel 4 transfer select 18: USCIB0 receive */
#define DMA4TSEL__USCIB0TX   (0x0013) /* DMA channel 4 transfer select 19: USCIB0 transmit */
#define DMA4TSEL__USCIA1RX   (0x0014) /* DMA channel 4 transfer select 20: USCIA1 receive */
#define DMA4TSEL__USCIA1TX   (0x0015) /* DMA channel 4 transfer select 21: USCIA1 transmit */
#define DMA4TSEL__USCIB1RX   (0x0016) /* DMA channel 4 transfer select 22: USCIB1 receive */
#define DMA4TSEL__USCIB1TX   (0x0017) /* DMA channel 4 transfer select 23: USCIB1 transmit */
#define DMA4TSEL__ADC12IFG   (0x0018) /* DMA channel 4 transfer select 24: ADC12IFGx */
#define DMA4TSEL__RES25      (0x0019) /* DMA channel 4 transfer select 25: Reserved */
#define DMA4TSEL__RES26      (0x001A) /* DMA channel 4 transfer select 26: Reserved */
#define DMA4TSEL__RES27      (0x001B) /* DMA channel 4 transfer select 27: Reserved */
#define DMA4TSEL__RES28      (0x001C) /* DMA channel 4 transfer select 28: Reserved */
#define DMA4TSEL__MPY        (0x001D) /* DMA channel 4 transfer select 29: Multiplier ready */
#define DMA4TSEL__DMA3IFG    (0x001E) /* DMA channel 4 transfer select 30: previous DMA channel DMA3IFG */
#define DMA4TSEL__DMAE0      (0x001F) /* DMA channel 4 transfer select 31: ext. Trigger (DMAE0) */

#define DMA5TSEL__DMA_REQ    (0x0000)  /* DMA channel 5 transfer select 0:  DMA_REQ (sw) */
#define DMA5TSEL__TA0CCR0    (0x0100)  /* DMA channel 5 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA5TSEL__TA0CCR2    (0x0200)  /* DMA channel 5 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA5TSEL__TA1CCR0    (0x0300)  /* DMA channel 5 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA5TSEL__TA1CCR2    (0x0400)  /* DMA channel 5 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA5TSEL__TA2CCR0    (0x0500)  /* DMA channel 5 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA5TSEL__TA2CCR2    (0x0600)  /* DMA channel 5 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA5TSEL__TB0CCR0    (0x0700)  /* DMA channel 5 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA5TSEL__TB0CCR2    (0x0800)  /* DMA channel 5 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA5TSEL__RES9       (0x0900)  /* DMA channel 5 transfer select 9:  Reserved */
#define DMA5TSEL__RES10      (0x0A00) /* DMA channel 5 transfer select 10: Reserved */
#define DMA5TSEL__RES11      (0x0B00) /* DMA channel 5 transfer select 11: Reserved */
#define DMA5TSEL__RES12      (0x0C00) /* DMA channel 5 transfer select 12: Reserved */
#define DMA5TSEL__RES13      (0x0D00) /* DMA channel 5 transfer select 13: Reserved */
#define DMA5TSEL__RES14      (0x0E00) /* DMA channel 5 transfer select 14: Reserved */
#define DMA5TSEL__RES15      (0x0F00) /* DMA channel 5 transfer select 15: Reserved */
#define DMA5TSEL__USCIA0RX   (0x1000) /* DMA channel 5 transfer select 16: USCIA0 receive */
#define DMA5TSEL__USCIA0TX   (0x1100) /* DMA channel 5 transfer select 17: USCIA0 transmit */
#define DMA5TSEL__USCIB0RX   (0x1200) /* DMA channel 5 transfer select 18: USCIB0 receive */
#define DMA5TSEL__USCIB0TX   (0x1300) /* DMA channel 5 transfer select 19: USCIB0 transmit */
#define DMA5TSEL__USCIA1RX   (0x1400) /* DMA channel 5 transfer select 20: USCIA1 receive */
#define DMA5TSEL__USCIA1TX   (0x1500) /* DMA channel 5 transfer select 21: USCIA1 transmit */
#define DMA5TSEL__USCIB1RX   (0x1600) /* DMA channel 5 transfer select 22: USCIB1 receive */
#define DMA5TSEL__USCIB1TX   (0x1700) /* DMA channel 5 transfer select 23: USCIB1 transmit */
#define DMA5TSEL__ADC12IFG   (0x1800) /* DMA channel 5 transfer select 24: ADC12IFGx */
#define DMA5TSEL__RES25      (0x1900) /* DMA channel 5 transfer select 25: Reserved */
#define DMA5TSEL__RES26      (0x1A00) /* DMA channel 5 transfer select 26: Reserved */
#define DMA5TSEL__RES27      (0x1B00) /* DMA channel 5 transfer select 27: Reserved */
#define DMA5TSEL__RES28      (0x1C00) /* DMA channel 5 transfer select 28: Reserved */
#define DMA5TSEL__MPY        (0x1D00) /* DMA channel 5 transfer select 29: Multiplier ready */
#define DMA5TSEL__DMA4IFG    (0x1E00) /* DMA channel 5 transfer select 30: previous DMA channel DMA4IFG */
#define DMA5TSEL__DMAE0      (0x1F00) /* DMA channel 5 transfer select 31: ext. Trigger (DMAE0) */



